Reports/КСУ_СостояниеФондов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Report>
		<Properties>
			<Name>КСУ_СостояниеФондов</Name>
		</Properties>
	</Report>
</MetaDataObject>

AccumulationRegisters/ИА_СредстваНаФондах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ИА_СредстваНаФондах</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаНал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаБезнал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Операция</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КСУ_ОперацииПоФондам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПояснениеТекст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПояснениеСсылка</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_ЦФО</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Фонд</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_Фонды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ИА_СредстваВРезервеНаФондах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ИА_СредстваВРезервеНаФондах</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаНал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаБезнал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_ЦФО</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗП</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ИА_ЗаказНаПриобретение</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Фонд</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_Фонды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Reports/КСУ_СостояниеФондов/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаСервере
Процедура СформироватьНаСервере()
	ТабДок.Очистить();
	
	отч = РеквизитФормыВЗначение("Отчет");
	макет = отч.ПолучитьМакет("Макет");
	
	Обл = макет.ПолучитьОбласть("Шапка");
	обл.параметры.ДатаОтчета = ТекущаяДата();
	обл.параметры.Период = формат(НаДату,"ДФ=dd.MM.yyyy");
	ТабДок.Вывести(обл);
	
	ЕстьФильтры = ложь;
	
	ВыбФонды = Новый массив;
	Для каждого стр из Фонды Цикл
		Если стр.выбрать Тогда
			ВыбФонды.Добавить(стр.фонд);
		Иначе
			ЕстьФильтры = истина;
		КонецЕсли;
	КонецЦикла;
	
	ВыбПодразделения = Новый массив;
	Для каждого стр из Подразделения Цикл
		Если стр.выбрать Тогда
			ВыбПодразделения.Добавить(стр.Подразделение);
		Иначе
			ЕстьФильтры = истина;
		КонецЕсли;
	КонецЦикла;
	ВсеПодр = ВыбПодразделения.Количество() = Подразделения.Количество();
	
	ВыбОрганизации = Новый массив;
	Для каждого стр из Организации Цикл
		Если стр.выбрать Тогда
			ВыбОрганизации.Добавить(стр.Организация);
		Иначе
			ЕстьФильтры = истина;
		КонецЕсли;
	КонецЦикла;
	
	
	Если ЕстьФильтры Тогда
		Обл = макет.ПолучитьОбласть("НеВсеФонды");		
		ТабДок.Вывести(обл);
	КонецЕсли;
	
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НаДату", КонецДня(НаДату));
	Запрос.УстановитьПараметр("НаДату1", КонецДня(НаДату) + 1);
	Запрос.УстановитьПараметр("Фонды", ВыбФонды);
	Запрос.УстановитьПараметр("Подразделения", ВыбПодразделения);
	Запрос.УстановитьПараметр("Организации", ВыбОрганизации);
	Запрос.УстановитьПараметр("ИспПодр", ИспПодр);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИА_СредстваНаФондахОстаткиИОбороты.Подразделение КАК Подразделение,
	               |	ИА_СредстваНаФондахОстаткиИОбороты.Фонд КАК Фонд,
	               |	ЕСТЬNULL(ИА_СредстваНаФондахОстаткиИОбороты.СуммаБезналКонечныйОстаток, 0) КАК Итого,
	               |	ЕСТЬNULL(ИА_СредстваВРезервеНаФондахОстатки.СуммаБезналОстаток, 0) КАК Зарезервировано,
	               |	ЕСТЬNULL(ИА_СредстваНаФондахОстаткиИОбороты.СуммаБезналКонечныйОстаток, 0) - ЕСТЬNULL(ИА_СредстваВРезервеНаФондахОстатки.СуммаБезналОстаток, 0) КАК Свободно,
	               |	ИА_СредстваНаФондахОстаткиИОбороты.Фонд.Счет КАК Счет,
	               |	ИА_СредстваНаФондахОстаткиИОбороты.Организация КАК Организация
	               |ИЗ
	               |	РегистрНакопления.ИА_СредстваНаФондах.ОстаткиИОбороты(
	               |			,
	               |			&НаДату,
	               |			,
	               |			,
	               |			Организация В (&Организации)
	               |				И ФОНД В (&Фонды)
	               |				И Подразделение В (&Подразделения)) КАК ИА_СредстваНаФондахОстаткиИОбороты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ИА_СредстваВРезервеНаФондах.Остатки(&НаДату1, ) КАК ИА_СредстваВРезервеНаФондахОстатки
	               |		ПО ИА_СредстваНаФондахОстаткиИОбороты.Подразделение = ИА_СредстваВРезервеНаФондахОстатки.Подразделение
	               |			И ИА_СредстваНаФондахОстаткиИОбороты.Фонд = ИА_СредстваВРезервеНаФондахОстатки.Фонд
	               |			И ИА_СредстваНаФондахОстаткиИОбороты.Организация = ИА_СредстваВРезервеНаФондахОстатки.Организация
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ИА_СредстваНаФондахОстаткиИОбороты.Подразделение.Наименование,
	               |	ИА_СредстваНаФондахОстаткиИОбороты.Фонд.Наименование";
	тз_ВсеДанные = запрос.Выполнить().Выгрузить();
	тз_Организации = тз_ВсеДанные.Скопировать(); 
	тз_Организации.Свернуть("Организация", "Свободно,Зарезервировано,Итого");
	
	/////////// ПО ОРГАНИЗАЦИЯМ
	Если Настройки[0].Выбрать Тогда
		Обл = макет.ПолучитьОбласть("табШапка");
		Обл.параметры.Заголовок = "СВОДНО: По организациям";
		Обл.параметры.ЗаголовокКолонки = "Организация (головная)";
		Обл.параметры.ЗаголовокИтого = "Всего на фондах";
		ТабДок.Вывести(обл);
		
		Для каждого стр из тз_Организации Цикл
			Обл = макет.ПолучитьОбласть("табСтрока");
			ЗаполнитьЗначенияСвойств(обл.параметры, стр);
			обл.параметры.Группировка = стр.Организация;
			ТабДок.Вывести(обл);
		КонецЦикла;
		
		Обл = макет.ПолучитьОбласть("табИтого");
		обл.параметры.Итого = тз_Организации.итог("Итого");
		обл.параметры.Зарезервировано = тз_Организации.итог("Зарезервировано");
		обл.параметры.Свободно = тз_Организации.итог("Свободно");
		ТабДок.Вывести(обл);
	КонецЕсли;		

	для каждого стрОрг из Организации Цикл
		если не стрОрг.Выбрать тогда
			Продолжить;
		КонецЕсли;
		
		/////////// ОРГАНИЗАЦИЯ
		Обл = макет.ПолучитьОбласть("ГруппаОрганизация");
		обл.параметры.Организация = стрОрг.Организация;
		ТабДок.Вывести(обл);
				
		
		ТекДанные = тз_ВсеДанные.Скопировать();
		Сч = ТекДанные.Количество() - 1;
		Пока сч >=0 Цикл
			если ТекДанные[сч].Организация <> стрОрг.Организация Тогда
				ТекДанные.Удалить(сч);
			КонецЕсли;				
			сч = сч - 1;
		КонецЦикла;
		
		Если ТекДанные.Количество() = 0 Тогда
			
			Обл = макет.ПолучитьОбласть("НетДвижений");		
			ТабДок.Вывести(обл);
		
			Продолжить;
		КонецЕсли;

		/////////// СЧЕТА
		Если Настройки[1].Выбрать Тогда
			Обл = макет.ПолучитьОбласть("Пустая");
			ТабДок.Вывести(обл);
			
			тз = ТекДанные.Скопировать(); 
			тз.Свернуть("Счет", "Свободно,Зарезервировано,Итого");
		
			Обл = макет.ПолучитьОбласть("табШапка");
			Обл.параметры.Заголовок = "СВОДНО: На счетах";
			Обл.параметры.ЗаголовокКолонки = "Счет";
			Обл.параметры.ЗаголовокИтого = "Всего на счете";
			ТабДок.Вывести(обл);
			
			Для каждого стр из тз Цикл
				Обл = макет.ПолучитьОбласть("табСтрока");
				ЗаполнитьЗначенияСвойств(обл.параметры, стр);
				обл.параметры.Группировка = стр.Счет;
				ТабДок.Вывести(обл);
			КонецЦикла;
			
			Обл = макет.ПолучитьОбласть("табИтого");
			обл.параметры.Итого = тз.итог("Итого");
			обл.параметры.Зарезервировано = тз.итог("Зарезервировано");
			обл.параметры.Свободно = тз.итог("Свободно");
			ТабДок.Вывести(обл);
		КонецЕсли;
		
		/////////// ПОДРАЗДЕЛЕНИЯ
		Если Настройки[2].Выбрать Тогда
			Обл = макет.ПолучитьОбласть("Пустая");
			ТабДок.Вывести(обл);
			
			тз = ТекДанные.Скопировать(); 
			тз.Свернуть("Подразделение", "Свободно,Зарезервировано,Итого");
		
			Обл = макет.ПолучитьОбласть("табШапка");
			Обл.параметры.Заголовок = "СВОДНО: По подразделениям";
			Обл.параметры.ЗаголовокКолонки = "Название подразделения";
			Обл.параметры.ЗаголовокИтого = "Всего у подразделения";
			ТабДок.Вывести(обл);
			
			Для каждого стр из тз Цикл
				Обл = макет.ПолучитьОбласть("табСтрока");
				ЗаполнитьЗначенияСвойств(обл.параметры, стр);
				обл.параметры.Группировка = стр.Подразделение;
				ТабДок.Вывести(обл);
			КонецЦикла;
			
			Обл = макет.ПолучитьОбласть("табИтого");
			обл.параметры.Итого = тз.итог("Итого");
			обл.параметры.Зарезервировано = тз.итог("Зарезервировано");
			обл.параметры.Свободно = тз.итог("Свободно");
			ТабДок.Вывести(обл);
		КонецЕсли;
		
		/////////// Подразделение | Фонд
		Если Настройки[3].Выбрать Тогда
			Обл = макет.ПолучитьОбласть("Пустая");
			ТабДок.Вывести(обл);
			
			тз = ТекДанные.Скопировать(); 
			тз.Свернуть("Подразделение", "Свободно,Зарезервировано,Итого");
		
			Обл = макет.ПолучитьОбласть("табШапкаГР");
			Обл.параметры.Заголовок = "СВОДНО: Подразделение | Фонд";
			Обл.параметры.ЗаголовокКолонки = "Название фонда";
			Обл.параметры.ЗаголовокИтого = "Всего";
			ТабДок.Вывести(обл);
			
			Для каждого стр из тз Цикл
				Обл = макет.ПолучитьОбласть("табСтрокаГР_гр");
				ЗаполнитьЗначенияСвойств(обл.параметры, стр);
				обл.параметры.Группировка = стр.Подразделение;
				ТабДок.Вывести(обл);
				
				СтрокиПоПодр = ТекДанные.НайтиСтроки(Новый структура("Подразделение", стр.Подразделение));
				Для каждого стрФонд из СтрокиПоПодр Цикл
					Обл = макет.ПолучитьОбласть("табСтрокаГР");
					ЗаполнитьЗначенияСвойств(обл.параметры, стрФонд);
					обл.параметры.Группировка = стрФонд.Фонд;
					ТабДок.Вывести(обл);
				КонецЦикла;
			КонецЦикла;
			
			Обл = макет.ПолучитьОбласть("табИтогоГР");
			обл.параметры.Итого = тз.итог("Итого");
			обл.параметры.Зарезервировано = тз.итог("Зарезервировано");
			обл.параметры.Свободно = тз.итог("Свободно");
			ТабДок.Вывести(обл);
		КонецЕсли;
		
		/////////// Счета | Подразделения
		Если Настройки[4].Выбрать Тогда
			Обл = макет.ПолучитьОбласть("Пустая");
			ТабДок.Вывести(обл);
			
			тз = ТекДанные.Скопировать(); 
			тз.Свернуть("Счет", "Свободно,Зарезервировано,Итого");
		
			Обл = макет.ПолучитьОбласть("табШапкаГР");
			Обл.параметры.Заголовок = "СВОДНО: Счета | Подразделения";
			Обл.параметры.ЗаголовокКолонки = "Название фонда";
			Обл.параметры.ЗаголовокИтого = "Всего";
			ТабДок.Вывести(обл);
			
			Для каждого стр из тз Цикл
				Обл = макет.ПолучитьОбласть("табСтрокаГР_гр");
				ЗаполнитьЗначенияСвойств(обл.параметры, стр);
				обл.параметры.Группировка = стр.Счет;
				ТабДок.Вывести(обл);
				
				ДанныеПоСчету = ТекДанные.Скопировать();
				Сч = ДанныеПоСчету.Количество() - 1;
				Пока сч >=0 Цикл
					если ДанныеПоСчету[сч].Счет <> стр.Счет Тогда
						ДанныеПоСчету.Удалить(сч);
					КонецЕсли;				
					сч = сч - 1;
				КонецЦикла;
				ДанныеПоСчету.Свернуть("Подразделение", "Свободно,Зарезервировано,Итого");

				Для каждого стрФонд из ДанныеПоСчету Цикл
					Обл = макет.ПолучитьОбласть("табСтрокаГР");
					ЗаполнитьЗначенияСвойств(обл.параметры, стрФонд);
					обл.параметры.Группировка = стрФонд.Подразделение;
					ТабДок.Вывести(обл);
				КонецЦикла;
			КонецЦикла;
			
			Обл = макет.ПолучитьОбласть("табИтогоГР");
			обл.параметры.Итого = тз.итог("Итого");
			обл.параметры.Зарезервировано = тз.итог("Зарезервировано");
			обл.параметры.Свободно = тз.итог("Свободно");
			ТабДок.Вывести(обл);
		КонецЕсли;
		
		
		/////////// Счета | Фонды
		Если Настройки[5].Выбрать Тогда
			Обл = макет.ПолучитьОбласть("Пустая");
			ТабДок.Вывести(обл);
			
			тз = ТекДанные.Скопировать(); 
			тз.Свернуть("Счет", "Свободно,Зарезервировано,Итого");
		
			Обл = макет.ПолучитьОбласть("табШапкаГР");
			Обл.параметры.Заголовок = "СВОДНО: Счета | Фонды";
			Обл.параметры.ЗаголовокКолонки = "Название фонда";
			Обл.параметры.ЗаголовокИтого = "Всего";
			ТабДок.Вывести(обл);
			
			Для каждого стр из тз Цикл
				Обл = макет.ПолучитьОбласть("табСтрокаГР_гр");
				ЗаполнитьЗначенияСвойств(обл.параметры, стр);
				обл.параметры.Группировка = стр.Счет;
				ТабДок.Вывести(обл);
				
				ДанныеПоСчету = ТекДанные.Скопировать();
				Сч = ДанныеПоСчету.Количество() - 1;
				Пока сч >=0 Цикл
					если ДанныеПоСчету[сч].Счет <> стр.Счет Тогда
						ДанныеПоСчету.Удалить(сч);
					КонецЕсли;				
					сч = сч - 1;
				КонецЦикла;
				ДанныеПоСчету.Свернуть("Фонд", "Свободно,Зарезервировано,Итого");

				Для каждого стрФонд из ДанныеПоСчету Цикл
					Обл = макет.ПолучитьОбласть("табСтрокаГР");
					ЗаполнитьЗначенияСвойств(обл.параметры, стрФонд);
					обл.параметры.Группировка = стрФонд.Фонд;
					ТабДок.Вывести(обл);
				КонецЦикла;
			КонецЦикла;
			
			Обл = макет.ПолучитьОбласть("табИтогоГР");
			обл.параметры.Итого = тз.итог("Итого");
			обл.параметры.Зарезервировано = тз.итог("Зарезервировано");
			обл.параметры.Свободно = тз.итог("Свободно");
			ТабДок.Вывести(обл);
		КонецЕсли;

		/////////// Счета | Фонды | Подразделения
		Если Настройки[5].Выбрать Тогда
			Обл = макет.ПолучитьОбласть("Пустая");
			ТабДок.Вывести(обл);
			
			тз = ТекДанные.Скопировать(); 
			тз.Свернуть("Счет", "Свободно,Зарезервировано,Итого");
		
			Обл = макет.ПолучитьОбласть("табШапкаГР");
			Обл.параметры.Заголовок = "СВОДНО: Счета | Фонды | Подразделения";
			Обл.параметры.ЗаголовокКолонки = "Название фонда";
			Обл.параметры.ЗаголовокИтого = "Всего";
			ТабДок.Вывести(обл);
			
			Для каждого стр из тз Цикл
				Обл = макет.ПолучитьОбласть("табСтрокаГР_грСиняя");
				ЗаполнитьЗначенияСвойств(обл.параметры, стр);
				обл.параметры.Группировка = врег(стр.Счет.Наименование);
				ТабДок.Вывести(обл);
				
				ДанныеПоСчету = ТекДанные.Скопировать();
				Сч = ДанныеПоСчету.Количество() - 1;
				Пока сч >=0 Цикл
					если ДанныеПоСчету[сч].Счет <> стр.Счет Тогда
						ДанныеПоСчету.Удалить(сч);
					КонецЕсли;				
					сч = сч - 1;
				КонецЦикла;
				ДанныеПоСчету.Свернуть("Фонд", "Свободно,Зарезервировано,Итого");

				Для каждого стрФонд из ДанныеПоСчету Цикл
					Обл = макет.ПолучитьОбласть("табСтрокаГР_гр1");
					ЗаполнитьЗначенияСвойств(обл.параметры, стрФонд);
					обл.параметры.Группировка = стрФонд.Фонд;
					ТабДок.Вывести(обл);
					
					//
					ДанныеПоСчетуФонду = ТекДанные.Скопировать();
					Сч = ДанныеПоСчетуФонду.Количество() - 1;
					Пока сч >=0 Цикл
						если ДанныеПоСчетуФонду[сч].Счет <> стр.Счет или ДанныеПоСчетуФонду[сч].Фонд <> стрФонд.Фонд Тогда
							ДанныеПоСчетуФонду.Удалить(сч);
						КонецЕсли;				
						сч = сч - 1;
					КонецЦикла;
					ДанныеПоСчетуФонду.Свернуть("Подразделение", "Свободно,Зарезервировано,Итого");
					Для каждого стрПодр из ДанныеПоСчетуФонду Цикл
						Обл = макет.ПолучитьОбласть("табСтрокаГР_серая");
						ЗаполнитьЗначенияСвойств(обл.параметры, стрПодр);
						обл.параметры.Группировка = стрПодр.Подразделение;
						ТабДок.Вывести(обл);
					КонецЦикла;
				КонецЦикла;
			КонецЦикла;
			
			Обл = макет.ПолучитьОбласть("табИтогоГР");
			обл.параметры.Итого = тз.итог("Итого");
			обл.параметры.Зарезервировано = тз.итог("Зарезервировано");
			обл.параметры.Свободно = тз.итог("Свободно");
			ТабДок.Вывести(обл);
		КонецЕсли;

		
			
	КонецЦикла; // по организациям
	
	Обл = макет.ПолучитьОбласть("Подвал");
	ТабДок.Вывести(обл);
	
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДок.АвтоМасштаб = Истина;
	
	Элементы.ТабДок.РежимМасштабированияПросмотра = РежимМасштабированияПросмотра.Обычный;
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)

	если НаДату = Дата(1,1,1) ТОгда
		ПоказатьПредупреждение(,"Укажите на какую дату формировать отчет!");
		Возврат;
	КонецЕсли;
	
	СформироватьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	НаДату = ТекущаяДата();
	ИспПодр = Константы.КСУ_ФП_ИспользоватьПодразделения.Получить(); 
	ЗаполнитьНастройки();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНастройки()

	НовстрН = Настройки.Добавить();
	НовстрН.Настройка = "По организациям";
	НовстрН.Выбрать = ложь;
	
	НовстрН = Настройки.Добавить();
	НовстрН.Настройка = "По счетам";
	НовстрН.Выбрать = истина;
	
	НовстрН = Настройки.Добавить();
	НовстрН.Настройка = "По подразделениям";
	НовстрН.Выбрать = ложь;
	
	НовстрН = Настройки.Добавить();
	НовстрН.Настройка = "Подразделение | Фонд";
	НовстрН.Выбрать = ИспПодр;
	
	НовстрН = Настройки.Добавить();
	НовстрН.Настройка = "Счета | Подразделения";
	НовстрН.Выбрать = ложь;
	
	НовстрН = Настройки.Добавить();
	НовстрН.Настройка = "Счета | Фонды";
	НовстрН.Выбрать = не ИспПодр;
	
	НовстрН = Настройки.Добавить();
	НовстрН.Настройка = "Счета | Фонды | Подразделения";
	НовстрН.Выбрать = ложь;
		
	//
	МассОрг = ИА_ФПСервер.ПолучитьОрганизацииДляОтчетов();
	Для каждого орг из МассОрг Цикл
		НовстрН = Организации.Добавить();
		НовстрН.Организация = орг;
		НовстрН.Выбрать = истина;
	КонецЦикла;
	Если не Константы.ИА_ФП_ВестиФППоОрганизациям.Получить() Тогда
		НовстрН = Организации.Добавить();
		НовстрН.Организация = Справочники.Организации.ПустаяСсылка();
		НовстрН.Выбрать = истина;
	КонецЕсли;
	
	//
	Выборка= Справочники.ИА_ЦФО.Выбрать(,,,"Наименование");
	Пока выборка.Следующий() Цикл
		Если не выборка.ПометкаУдаления Тогда
			НовстрН = Подразделения.Добавить();
			НовстрН.Подразделение = Выборка.ссылка;
			НовстрН.Выбрать = истина;
		КонецЕсли;
	КонецЦикла;
	НовстрН = Подразделения.Добавить();
	НовстрН.Подразделение = Справочники.ИА_ЦФО.ПустаяСсылка();
	НовстрН.Выбрать = истина;
	
	//
	Запрос = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ИА_СредстваНаФондахОстаткиИОбороты.Фонд КАК Фонд,
	               |	ИА_СредстваНаФондахОстаткиИОбороты.Фонд.Счет КАК Счет,
	               |	ИА_СредстваНаФондахОстаткиИОбороты.Фонд.ПометкаУдаления КАК ПометкаУдаления,
	               |	ИА_СредстваНаФондахОстаткиИОбороты.Фонд.Защищенный КАК Защищенный
	               |ИЗ
	               |	РегистрНакопления.ИА_СредстваНаФондах.ОстаткиИОбороты(, , , , ) КАК ИА_СредстваНаФондахОстаткиИОбороты
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ИА_СредстваНаФондахОстаткиИОбороты.Фонд.Наименование";

	Выборка= Запрос.Выполнить().Выбрать();
	ЭтоРСФ = ИА_ФП.ЭтоРСФ();
	//Выборка= Справочники.ИА_Фонды.Выбрать();
	Пока выборка.Следующий() Цикл
		Если не выборка.ПометкаУдаления Тогда
			Если ЭтоРСФ или выборка.Защищенный = ложь Тогда   
				НовстрН = Фонды.Добавить();
				НовстрН.Фонд = Выборка.Фонд;
				НовстрН.Выбрать = истина;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;


КонецПроцедуры


&НаКлиенте
Процедура ПоказатьСкрытьФильтры(Команда)
	Элементы.ГруппаПравая.Видимость = не Элементы.ГруппаПравая.Видимость;
	Элементы.ПоказатьСкрытьФильтры.Заголовок = ?(Элементы.ГруппаПравая.Видимость, "Скрыть фильтры", "Показать фильтры")
КонецПроцедуры


&НаКлиенте
Процедура НастройкиВыбратьПриИзменении(Элемент)
	Элементы.ГруппаНастройки.ЦветТекстаЗаголовка = новый цвет(90, 150, 249);
	для каждого стр из Настройки Цикл
		если стр.выбрать = ложь тогда
			Элементы.ГруппаНастройки.ЦветТекстаЗаголовка = новый цвет(255, 0, 0);	
			Элементы.СброситьФильтры.Видимость = истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура Настройки1ВыбратьПриИзменении(Элемент)
	Элементы.ГруппаОрганизации.ЦветТекстаЗаголовка = новый цвет(90, 150, 249);
	для каждого стр из Организации Цикл
		если стр.выбрать = ложь тогда
			Элементы.ГруппаОрганизации.ЦветТекстаЗаголовка = новый цвет(255, 0, 0);	
			Элементы.СброситьФильтры.Видимость = истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура ФондыВыбратьПриИзменении(Элемент)
	Элементы.ГруппаФонды.ЦветТекстаЗаголовка = новый цвет(90, 150, 249);
	для каждого стр из Фонды Цикл
		если стр.выбрать = ложь тогда
			Элементы.ГруппаФонды.ЦветТекстаЗаголовка = новый цвет(255, 0, 0);
			Элементы.СброситьФильтры.Видимость = истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура ВыбратьВсеНастройки(Команда)
	Элементы.ГруппаНастройки.ЦветТекстаЗаголовка = новый цвет(90, 150, 249);
	для каждого стр из Настройки Цикл
		стр.выбрать = истина;
	КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура СнятьВыборСоВсехНастроек(Команда)
	Элементы.ГруппаНастройки.ЦветТекстаЗаголовка = новый цвет(255, 0, 0);
	для каждого стр из Настройки Цикл
		стр.выбрать = ложь;
	КонецЦикла;
	
	Элементы.СброситьФильтры.Видимость = истина;
КонецПроцедуры


&НаКлиенте
Процедура ВыбратьВсеОрганизации(Команда)
	Элементы.ГруппаОрганизации.ЦветТекстаЗаголовка = новый цвет(90, 150, 249);
	для каждого стр из Организации Цикл
		стр.выбрать = истина;
	КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура СнятьВыборСоВсехОрганизаций(Команда)
	Элементы.ГруппаОрганизации.ЦветТекстаЗаголовка = новый цвет(255, 0, 0);
	для каждого стр из Организации Цикл
		стр.выбрать = ложь;
	КонецЦикла;

	Элементы.СброситьФильтры.Видимость = истина;
КонецПроцедуры


&НаКлиенте
Процедура ВыбратьВсеФонды(Команда)
	Элементы.ГруппаФонды.ЦветТекстаЗаголовка = новый цвет(90, 150, 249);
	для каждого стр из Фонды Цикл
		стр.выбрать = истина;
	КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура СнятьВыборСоВсехФондов(Команда)
	Элементы.ГруппаФонды.ЦветТекстаЗаголовка = новый цвет(255, 0, 0);
	для каждого стр из Фонды Цикл
		стр.выбрать = ложь;
	КонецЦикла;
	
	Элементы.СброситьФильтры.Видимость = истина;
КонецПроцедуры


&НаКлиенте
Процедура СброситьФильтры(Команда)
	ВыбратьВсеНастройки(Неопределено);
	ВыбратьВсеОрганизации(Неопределено);
	ВыбратьВсеПодразделения(Неопределено);
	ВыбратьВсеФонды(Неопределено);
	
	Элементы.СброситьФильтры.Видимость = ложь;
КонецПроцедуры


&НаКлиенте
Процедура ЗакрытьВсеГруппы(Команда)
	Элементы.ГруппаОрганизации.Скрыть();
	Элементы.ГруппаПодразделения.Скрыть();
	Элементы.ГруппаФонды.Скрыть();
	Элементы.ГруппаНастройки.Скрыть();
КонецПроцедуры


&НаКлиенте
Процедура РазвернутьВсеГруппы(Команда)
	Элементы.ГруппаОрганизации.Показать();
	Элементы.ГруппаПодразделения.Показать();
	Элементы.ГруппаФонды.Показать();
	Элементы.ГруппаНастройки.Показать();
КонецПроцедуры


&НаКлиенте
Процедура pdf(Команда)
	Оповещение  = Новый ОписаниеОповещения("ПутьКФайлуНачалоВыбораЗавершение", ЭтаФорма);
    ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение); 
	ДиалогВыбора.ПолноеИмяФайла = "Остатки на счетах и фондах на "+ формат(НаДату, "ДФ=dd.MM.yyyy");
	ДиалогВыбора.Расширение = "pdf";
    ДиалогВыбора.Показать(Оповещение);
КонецПроцедуры

&НаКлиенте
Процедура ПутьКФайлуНачалоВыбораЗавершение(МассивФайлов, ДопПараметры) Экспорт
    Если МассивФайлов = Неопределено Тогда
        Возврат;
	КонецЕсли;
	
	ТабДок.Записать(МассивФайлов[0], ТипФайлаТабличногоДокумента.PDF);
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	НаДату = ТекущаяДата();
КонецПроцедуры


&НаКлиенте
Процедура ВыбратьВсеПодразделения(Команда)
	Элементы.ГруппаПодразделения.ЦветТекстаЗаголовка = новый цвет(90, 150, 249);
	для каждого стр из Подразделения Цикл
		стр.выбрать = истина;
	КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура СнятьВыборСоВсехПодразделений(Команда)
	Элементы.ГруппаПодразделения.ЦветТекстаЗаголовка = новый цвет(255, 0, 0);
	для каждого стр из Подразделения Цикл
		стр.выбрать = ложь;
	КонецЦикла;
	
	Элементы.СброситьФильтры.Видимость = истина;
КонецПроцедуры


&НаКлиенте
Процедура ПодразделенияВыбратьПриИзменении(Элемент)
	Элементы.ГруппаПодразделения.ЦветТекстаЗаголовка = новый цвет(90, 150, 249);
	для каждого стр из Подразделения Цикл
		если стр.выбрать = ложь тогда
			Элементы.ГруппаПодразделения.ЦветТекстаЗаголовка = новый цвет(255, 0, 0);
			Элементы.СброситьФильтры.Видимость = истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
